[
    {
        "text": "Leonard and Sheldon meet their new neighbor Penny, who they both are interested in. Despite some mishaps, they befriend Penny after she offers to take them out to dinner."
    },
    {
        "text": "Sheldon and Leonard clean Penny's messy apartment while she sleeps, causing her anger. Sheldon's awkward apology fails, but later Penny forgives and hugs Leonard after he apologizes. She also hugs Raj, who she confides in."
    },
    {
        "text": "Leonard is devastated after seeing Penny kissing another man. He tries dating Leslie Winkle but is rejected. Sheldon points out Leonard never asked Penny out, so he does and she misinterprets it. Penny reveals she's not in a serious relationship, giving Leonard hope, but he still can't confess his feelings."
    },
    {
        "text": "Sheldon gets fired and falls into depression. Leonard calls his caring, down-to-earth mother, Mary, who makes Sheldon apologize and gets his job back by flirting with his boss."
    },
    {
        "text": "Penny's coworker Leslie seduces Leonard, leaving Sheldon uneasy. Leonard later realizes Leslie only wanted a one-night stand. He rejects an imaginary relationship with Penny for a real one with Leslie, who then rejects him. Penny reassures him."
    },
    {
        "text": "Penny invites the guys to her Halloween party. They struggle to socialize in their costumes. Penny's ex causes a scene, leading to Leonard comforting her and they share a drunken kiss. Meanwhile, Raj connects with a girl at home."
    },
    {
        "text": "Penny's promiscuous friend Christy arrives and causes chaos by sleeping with Howard and moving in with him. Penny replaces Howard in Halo 3, but he reconciles with the group after Christy leaves. The group ignores Penny and her friends, restoring their dynamic."
    },
    {
        "text": "Raj's parents try to arrange a date for him, but he's unable to talk to women. Howard sets him up with Lalita, and they discover Raj can talk to women when he's drunk. The date turns chaotic and Sheldon ends up impressing Lalita. Raj's parents are angry about his drinking, and Sheldon reveals he already has a dentist."
    },
    {
        "text": "Leonard finds conference invitation, goes alone despite Sheldon's disapproval. Rift between them worsened by Penny. Sheldon disrupts Leonard's presentation, leads to physical fight. Howard posts it online, causing further drama with Penny."
    },
    {
        "text": "Penny gets a role in Rent but Leonard and Sheldon don't want to see her perform. Leonard lies but Sheldon goes to extreme lengths to keep up the lie about his nonexistent cousin needing an intervention. In the end, Leonard sees Penny's performance and \"Leo\" flirts with her."
    },
    {
        "text": "Penny returns from Nebraska, mentioning sick relatives. Germophobe Sheldon freaks out, gets sick, and demands care. Leonard and friends hide at a movie marathon, leaving Penny to care for Sheldon. Leonard breaks his glasses and is abandoned to care for Sheldon. In the end, injured Leonard and sick Sheldon sit miserably on the couch."
    },
    {
        "text": "Sheldon meets a smarter child prodigy, Dennis Kim, and becomes envious. He loses faith in his own work and annoys his friends. Sheldon aims for the Nobel Peace Prize but annoys everyone. His friends distract Kim with girls, and Sheldon mocks him when he succumbs to drinking and making out."
    },
    {
        "text": "Sheldon gets ejected from a university physics quiz team for his showboating. He forms his own team to compete against them. The guys recruit Leslie Winkle to be their fourth member. Sheldon's team, AA, includes the janitor, lunch lady, and her son. PMS wins when Sheldon rejects the janitor's correct answer."
    },
    {
        "text": "Leonard mistakenly buys a life-sized time machine replica and decides to sell all his collectibles when Penny criticizes his obsession. His friends argue over who should get his belongings. Penny apologizes, and Leonard decides to keep his collectibles. Sheldon has nightmares and persuades Leonard to keep the time machine replica."
    },
    {
        "text": "Sheldon's twin sister Missy meets the guys, leading to awkward flirting. Raj takes a drug trial to talk to women, while Leonard tries to control Missy's dating choices with Sheldon's help. Missy rejects Leonard and Howard, but shows interest in Raj before the drug wears off and leaves him unable to speak to her."
    },
    {
        "text": "Penny plans a surprise birthday party for Leonard. She blackmails Sheldon into joining by threatening his comic books. Howard fakes an allergic reaction to keep Leonard out, but ends up in the hospital. When they return, the party is over, but Penny kisses Leonard."
    },
    {
        "text": "Penny and Mike break up over blog post. Sheldon learns Mandarin. Leonard asks Penny out. Sheldon advises them to go on the date. They kiss and go to dinner, but leave when they see Sheldon arguing in Mandarin at the restaurant."
    },
    {
        "text": "Leonard and Penny's date is monitored by Howard and Raj, who believe it went badly. Penny lies to Leonard about her education. Sheldon struggles to keep the secret and moves out. Drugged Sheldon reveals the secret to Leonard. Penny is hurt but Leonard doesn't mind dating her."
    },
    {
        "text": "Leonard is pursued by Leslie after Penny dates Eric to make him jealous. Leslie wants a slow relationship but dumps Leonard when he sides with Sheldon in a scientific argument. Sheldon comforts Leonard, looking forward to Comic-Con."
    },
    {
        "text": "Penny gets locked out and becomes addicted to a video game. Sheldon tries to help her, but fails. He eventually realizes she needs to have sex to relieve stress. He tries to set her up on a date, but she realizes it's with Howard and stops playing the game."
    },
    {
        "text": "Raj is honored by People magazine, but his arrogance drives his friends away. He invites Penny to his party, and after getting drunk, introduces her to his disapproving parents. The next day, he apologizes to Penny, who forgives him."
    },
    {
        "text": "Leonard avoids driving Sheldon to work, leading to the group staging an intervention for Sheldon to learn to drive. Sheldon gets a learner's permit but proves to be a terrible driver. He decides to live in his office to avoid commuting, and Leonard reveals he finished his experiment earlier to avoid driving Sheldon."
    },
    {
        "text": "Ramona becomes Sheldon's assistant and moves in to control him, but he eventually realizes her manipulative ways and ends their relationship. Another student then tries to insinuate herself into Sheldon's life in the same way Ramona did."
    },
    {
        "text": "Penny's TV gets blocked due to missed payments, leading to a feud with Sheldon. They clash by disrupting each other's routines until Leonard gives Penny Sheldon's mother's contact. Meanwhile, Howard and Raj sneak into the America's Next Top Model house."
    },
    {
        "text": "Howard meets Dr. Stephanie Barnett at a bar and invites her to JPL to drive the Mars rover, but it gets stuck. Stephanie likes Leonard more and dates him. Howard forgives them and they go on a double date. Howard destroys security data, and the rover finds water on Mars. Sheldon, Raj, and Howard play a game but keep choosing the same option."
    },
    {
        "text": "Sheldon interferes in Leonard's relationship with Stephanie, leading to a series of misadventures. Despite his missteps, Sheldon ultimately believes his intervention helps Leonard and Stephanie get closer, which he sees as a personal victory."
    },
    {
        "text": "Stephanie moves in with Leonard and Sheldon. Leonard tries to break up with her but is repeatedly distracted by sex. Meanwhile, Stephanie gives Sheldon a fake diagnosis and instructs him not to speak."
    },
    {
        "text": "Leonard meets successful physicist Dr. David, who dates Penny. Leonard misunderstands and confronts Penny, but they reconcile. Meanwhile, Sheldon struggles to find a gift for Penny and ends up giving her multiple baskets. Penny gives Sheldon a unique autographed napkin, leading to an unexpected exchange of gifts."
    },
    {
        "text": "Howard designs combat robot M.O.N.T.E. for a competition. He flirts with Penny but is rejected. Depressed, Leonard convinces Penny to apologize. Howard confesses his failures and tries to kiss her, getting punched. In a robot fight, M.O.N.T.E. is destroyed by a superior robot controlled by Barry Kripke."
    },
    {
        "text": "Sheldon wants computer access, befriends Kripke. Sheldon struggles with friendship, seeks self-help books. Tries making friends with a little girl, faints while rock climbing with Kripke. Decides to cut off Raj, but restores him when Kripke can't help."
    },
    {
        "text": "Penny is in financial trouble. Sheldon lends her money, Leonard tries to help cut her expenses. Leonard and the guys try to retrieve money from her ex, Kurt, but fail. Penny repays Sheldon after Kurt repays her, not knowing about Leonard's visit."
    },
    {
        "text": "Leonard's mother, Beverly, visits and psychoanalyzes Penny, upsetting her. Beverly gets along with Sheldon but dismisses Howard and Raj. After talking about their childhood issues, Penny and Leonard sleep together. Leonard ruins the moment by mentioning psychoanalytic theory, causing Penny to throw him out. Leonard thinks Penny never has to talk to him again."
    },
    {
        "text": "Penny shoots paintballs at Sheldon's cushion, tries to fix it. Sheldon team-kills Penny in paintball. Leslie uses sex to control Howard but he later accepts role happily."
    },
    {
        "text": "The guys go to a conference in San Francisco, where Raj tries to impress Summer Glau but fails due to his non-alcoholic beer. Howard's awkward attempts also fail, and Leonard misses his chance to meet her. Meanwhile, Sheldon forgets his presentation and needs Penny's help. At the conference, Nobel laureate Dr. Smoot is unimpressed with Sheldon."
    },
    {
        "text": "Penny starts 'Penny Blossoms' hair barrettes business with friends' help. They get a huge order from a LGBT Alliance, but struggle with rush shipping. After doubling the order, the guys quit, leaving Sheldon to help fulfill it in his own unique way."
    },
    {
        "text": "Former tenants move out, actress Alicia moves in above Leonard and Sheldon. She exploits the guys, causing Penny to resent her. Penny tries to win back their attention, but after Alicia brags about exploiting the men, a fight breaks out. It is revealed Alicia is sleeping with a CSI producer."
    },
    {
        "text": "Penny goes to the comic book store with the guys, and the owner asks her out, making Leonard jealous. Leonard tries to meet women at a bar but fails. Stuart's date with Penny goes well until Sheldon interrupts, arguing about who should be the next Batman, and Penny falls asleep."
    },
    {
        "text": "Leslie ends relationship with Howard, upsetting him. Leonard and Raj take him to Vegas. They hire a prostitute for Howard, who realizes the truth but thanks them. Sheldon stays with Penny, sleeps in her bed, and thinks he understands \"friends with benefits\"."
    },
    {
        "text": "Howard invents a faulty space toilet for the ISS, leading to a frantic repair effort with his friends. Meanwhile, Leonard gives bad dating advice to Stuart, who ends up kissing Penny and being called \"Leonard,\" making Leonard secretly happy."
    },
    {
        "text": "Sheldon wins grant to Magnetic North Pole. He, Leonard, Howard, and Raj prepare to go. Leonard hesitates because of Penny. Penny gives Leonard a blanket with sleeves and wishes him a safe trip. When Leonard leaves, Penny whispers sadly that she wishes he wasn't going."
    },
    {
        "text": "Penny confesses her feelings for Leonard and they kiss. Sheldon leaves for his mother's house after learning his friends tampered with his experiment. Mary convinces Sheldon to forgive Leonard. Leonard and Penny have sex but feel things are weird between them."
    },
    {
        "text": "Leonard and Penny struggle between friendship and romance. They get drunk and vomit. Sheldon and Howard bet on a cricket's species, involving an entomologist. Sheldon loses and encourages Penny and Leonard to remain friends. However, they end up having sex again."
    },
    {
        "text": "Penny's bed breaks, so she stays with Leonard and Sheldon. Sheldon uses chocolate to condition her behavior. Howard and Raj pretend to be goths to meet girls but back out of getting tattoos."
    },
    {
        "text": "Raj faces deportation due to failed research. Sheldon offers him a job but they clash. Sheldon apologizes, but disagrees. Howard disrupts Leonard and Penny."
    },
    {
        "text": "Howard reminds Leonard of their pact. Penny sets Howard up with her friend Bernadette. Meanwhile, Sheldon and Raj enter a card game tournament to compete against Sheldon's childhood rival, Wil Wheaton. Bernadette and Howard bond over their relationships with their mothers."
    },
    {
        "text": "Leonard tries to bond with Penny's football friends, aided by Sheldon's unexpected football knowledge. Sheldon later feels left out when Leonard won't fly kites. Howard's pursuit of women upsets Raj. Penny allows Leonard to leave the party, pointing out his boredom."
    },
    {
        "text": "Penny's guitarist friend stays on her couch, upsetting Leonard. Sheldon is affected by his parents' fighting. Meanwhile, Raj and Howard also have arguments with their parents."
    },
    {
        "text": "Sheldon drives Penny to the hospital. Leonard, Raj, and Howard eat \"magic\" cookies while camping and reveal strange secrets, forgetting about the meteor shower."
    },
    {
        "text": "Howard proposes to Bernadette after three dates, but she declines. He wins her over with a cheesy love song. Sheldon and Kripke's prank war escalates, leading to a embarrassing incident in front of President Siebert and the Board of Directors. Sheldon confesses his involvement in a pre-recorded message on Kripke's computer."
    },
    {
        "text": "Howard is jealous of Leonard's work and causes tension. Penny feels left out and asks Sheldon to teach her physics."
    },
    {
        "text": "Leonard's mother visits at Christmas, upsetting Penny. She's also upset that Leonard hasn't told his mother about their relationship, while Sheldon knows more about Leonard's parents than he does."
    },
    {
        "text": "Penny seeks advice from a psychic, upsetting Leonard. Sheldon and Raj date two women from a mixer, Raj bribing Sheldon to help. Awkwardness follows."
    },
    {
        "text": "Sheldon's apartment is robbed, making him anxious for his safety. He implements new security measures to protect himself and his belongings."
    },
    {
        "text": "Sheldon takes a menial job due to an obsession with a physics problem, compared himself to Einstein. Raj feels left out when Leonard, Penny, Howard, and Bernadette go on a double-date at a roller skating rink."
    },
    {
        "text": "Sheldon feels betrayed when Leonard chooses Penny over him for a trip to Switzerland. He tries to convince Penny to drop out, causing Leonard to end their friendship. When Penny gets sick, Leonard changes his mind, only to find out Sheldon is sick too. Sheldon caught it from hugging Penny."
    },
    {
        "text": "Sheldon needs to meet Stan Lee but has a court appearance after driving too slow. He enlists Penny's help to win the judge's favor."
    },
    {
        "text": "Sheldon, Raj, Leonard, and Howard get a fake One Ring, leading to fights and deceptions as they try to keep it. Penny is shocked by their behavior."
    },
    {
        "text": "Sheldon's fear of public speaking is overcome with help, but he has a meltdown on stage after getting drunk, which goes viral."
    },
    {
        "text": "Leonard tells Penny he loves her, but she doesn't respond. They reflect on their relationship at a bowling match. Sheldon's rival, Wil Wheaton, adds to the tension."
    },
    {
        "text": "Sheldon works to keep his friendships with Leonard and Penny after their breakup, and they consider if they can remain friends."
    },
    {
        "text": "Dr. Elizabeth Plimpton stays with Sheldon but becomes interested in Leonard. She sleeps with Leonard and Raj, and proposes a foursome with Howard, causing jealousy and confusion."
    },
    {
        "text": "Leonard seeks shelter in Penny's apartment after a fight with Sheldon. He recounts the trials of becoming Sheldon's roommate in 2003, shedding light on Sheldon's character and the broken elevator's origins."
    },
    {
        "text": "Penny introduces Zack to friends, grows disappointed with him, and breaks up. She then has drunken sex with Leonard. Raj and Howard create a dating profile for Sheldon, which surprisingly matches him with a woman, Amy Farrah Fowler. When they meet, they find they have a lot in common."
    },
    {
        "text": "Howard's robotic hand malfunctions during masturbation, sending him to the hospital. Penny discovers Sheldon's plan to have a child with Amy and encourages him to be intimate first. Sheldon, Amy, and Penny have an awkward first date, and Sheldon cancels the plan for a child when Penny threatens to tell his mother."
    },
    {
        "text": "Sheldon fears missing singularity, tries healthy living, hides as \"Shelbot\". Sees Wozniak, rushes computer, breaks it and ankle."
    },
    {
        "text": "Sheldon and Amy's relationship annoys the group. After a fight, they break up but Sheldon brings 25 cats home. Leonard seeks help from Sheldon's mother to get them back together."
    },
    {
        "text": "Howard reconciles with Bernadjson's advice. Sheldon and Raj argue over a desk in their small office."
    },
    {
        "text": "Amy wants to introduce Sheldon to her mother, but he panics and tries to avoid her. They eventually have to tell Amy's mother they are in a sexual relationship, which goes badly. Meanwhile, Howard and Bernadette set up a double date with Leonard and a friend, Joy, who behaves badly. Despite this, Leonard agrees to another date with her."
    },
    {
        "text": "Raj's sister Priya visits and sleeps with Leonard, unknown to everyone. Sheldon conceals the truth, but Leonard confesses to Raj. Raj forgives him, leading to a group confession of their deceptions."
    },
    {
        "text": "FBI agent interviews Howard's friends for clearance. Raj and Leonard embarrass themselves. Sheldon shares Howard's mishap. Howard rejects Sheldon's apologies until allowed to sit in his spot on the couch, which is taken back by Sheldon. Howard is rejected for the project."
    },
    {
        "text": "The men try to see exclusive footage of \"Raiders of the Lost Ark\" but are blocked by Wil Wheaton. Sheldon steals the film. Amy joins a girls' night and Penny is questioned about her breakup with Leonard, causing tension."
    },
    {
        "text": "Penny asks Leonard to pretend they're still together for her father. Wyatt confronts Penny about her trust issues, pleads with Leonard to not give up on her. Sheldon amends roommate agreement unnecessarily. Raj gets drunk and tries to kiss Bernadette, but ends up kissing Howard."
    },
    {
        "text": "Amy feels sexual arousal after meeting Penny's ex-boyfriend Zack. Sheldon thinks Amy has an alien parasite. Penny suggests Sheldon have coitus with Amy, but he arranges for Amy to meet Zack again. Zack's lack of intelligence solves the problem. Howard and Raj argue about being a sidekick and end up in a wrestling match refereed by Leonard."
    },
    {
        "text": "Penny reunites with Zack, but after an argument, she joins her friends in a costume contest. Leonard's encouragement makes Penny change her mind about spending New Year's Eve with Zack. They win the contest, but flee a crime scene despite wearing superhero costumes."
    },
    {
        "text": "Leonard has an idea for an app, but Sheldon tries to take over. When rejected, he disrupts with a theremin. Penny tries to reconcile, but Sheldon ends up helping her create a shoe shopping app."
    },
    {
        "text": "Amy invites Penny to a science conference in Big Sur. At the conference, Howard's insecurities cause a chain reaction of bed swapping and personal recriminations. Sheldon tries to salvage the science panel, but only Penny's request for a ride home interrupts. Tensions rise on the drive back, except for Sheldon."
    },
    {
        "text": "Sheldon's condescending nature leads to Amy suggesting acting lessons from Penny. They use a Star Trek script Sheldon wrote as a child. During the performance, Sheldon becomes emotional and is consoled by his mother over the phone. Meanwhile, Raj develops feelings for Bernadette."
    },
    {
        "text": "President Siebert invites the men to a fundraising event at Caltech. Sheldon initially refuses to attend, but changes his mind to support physics. At the event, Leonard impresses Mrs. Latham, who later offers to donate money in exchange for sex. Leonard refuses, but is pressured to go through with it and receives praise at work."
    },
    {
        "text": "\"Priya and Leonard date again, causing jealousy in Penny. Amy measures Penny's brainwaves. Bernadette wants Howard to move in with her, but he feels guilty leaving his mother. Eventually, Bernadette agrees to let Howard move back in with his mother.\""
    },
    {
        "text": "Leonard and Priya are dating, so the gang decides to have dinner at Raj's place. Sheldon sets up a new group but ends up missing his old friends. Meanwhile, Bernadette and Amy try to cheer up Penny, who realizes she still has feelings for Leonard."
    },
    {
        "text": "Priya controls Leonard in his relationship, makes him cut ties with Penny. Howard, Raj, and Penny trick Sheldon into trying to figure out a fake card trick, causing chaos. Penny eventually realizes Priya's manipulation and cuts ties with Leonard."
    },
    {
        "text": "Sheldon's WoW account is hacked, and the guys track down the hacker, Todd Zarnecki. Penny, Amy, and Bernadette criticize Priya. Howard traces Todd and the guys confront him, but their car breaks down. Penny helps them, and then takes them back to Todd's house to retrieve Sheldon's stuff by force."
    },
    {
        "text": "Bernadette considers breaking up with Howard but he decides to propose. Raj hopes she'll reject and date him. Amy and Sheldon experiment with gossip. Bernadette accepts Howard's proposal, disappointing Raj."
    },
    {
        "text": "Leonard breaks roommate rules, Priya defends him. Sheldon dislikes Greek food, seeks refuge with Penny. Girls take Sheldon dancing, Amy kisses him. Sheldon blackmails Leonard into signing new agreement to keep relationship with Priya."
    },
    {
        "text": "Bernadette and Howard go on a double date with Priya, while Amy uses Bernadette to spy on Priya. Raj seeks advice from Sheldon about curing his social anxiety with an experimental drug. The drug works well at first, but Raj loses control and scares off a potential date. In the end, Sheldon, Leonard, and Howard test a new chess game while Raj watches, still naked."
    },
    {
        "text": "Bernadette and Howard tell their parents about their engagement. Howard's mother collapses, thinking it's a heart attack. It's actually food poisoning. Howard and Bernadette fight, while Sheldon gets quarantined in the hospital. Priya and Penny bond over Leonard."
    },
    {
        "text": "Bernadette celebrates her Ph.D. and job offer. Howard is upset when she buys him an expensive watch. Raj moves in with Sheldon after Leonard and Priya's noisy sex drives him out. Leonard overhears Priya's plans to move back to India and confronts her. Penny gets drunk and wakes up next to Raj, causing a stir with the others."
    },
    {
        "text": "Raj upsets Leonard and Howard after a night with Penny. He confesses his feelings to Penny, who decides to move back. Sheldon becomes captain."
    },
    {
        "text": "Penny gets a new chair from the street. Sheldon likes it until he learns where it's from. He nags Penny to get rid of it, but she refuses. Melissa Rauch is not in this episode."
    },
    {
        "text": "Sheldon buys a model train set, Amy takes Leonard to a wedding, and Howard asks Bernadette to move in with him and his mother after their marriage. Bernadette agrees to a weekend trial."
    },
    {
        "text": "Penny sets up Raj on a date with a deaf friend. Sheldon uses D&D dice for trivial decisions, leading to efficiency but also odd choices."
    },
    {
        "text": "Howard is excited to join a space mission. Sheldon and Leonard are invited to a party by Wil Wheaton while at a comic book store."
    },
    {
        "text": "Sheldon's mother visits but goes sightseeing instead of taking care of him. Amy helps him realize his emotional reactions are normal. Sheldon gets sick and his mother nurses him back to health."
    },
    {
        "text": "Leonard meets Alice at a comic book store and is tempted to cheat on his girlfriend, Priya. He seeks advice from Penny and Sheldon, and ultimately decides to go to Alice's apartment. However, he confesses to Alice and then learns that Priya cheated on him. They break up. Meanwhile, Sheldon's Halloween pranks fail."
    },
    {
        "text": "Amy feels left out when Penny and Bernadette go dress shopping without her. Sheldon cuddles her, but rejects her advances. He demands an apology for her, leading to a confrontation. Penny and Bernadette apologize, but Amy brushes them off. When Amy gets drunk, Sheldon and Leonard take her home. Bernadette asks Amy to be her maid of honor, and they make up."
    },
    {
        "text": "Leonard and Penny go to the movies as friends, but their interactions become complicated. Meanwhile, Sheldon deals with his fear of birds, eventually befriending one. At the end, Sheldon discovers an egg in the bird's nest, expressing his intention to become \"a mommy\" by incubating the egg."
    },
    {
        "text": "Amy goes on a date with Stuart, making Sheldon jealous. To make Amy jealous, he asks Penny out, who tells him to confess his feelings. Sheldon interrupts Amy's date and proposes a relationship agreement. The guys discover a new expansion pack for Mystic Warlords of Ka'a, leading to competition."
    },
    {
        "text": "Leonard reunites with high school bully Speckerman, who seeks his help for a 3D glasses idea. Sheldon defends Leonard, but Speckerman apologizes and stays over. The next day, he bullies Leonard again. Meanwhile, Penny regrets her past bullying and tries to make up for it, but fails. The girls also make questionable choices while trying to do charity."
    },
    {
        "text": "Sheldon dismisses Amy's achievement, upsetting her. He buys her a tiara to make up, and she forgives him. Meanwhile, Howard and Bernadette clash over having children, but she agrees to have them if Howard stays home to care for them."
    },
    {
        "text": "Leonard asks Penny on a date, they argue then have sex. They decide to pursue a secret relationship; Leonard struggles to keep it secret. It's revealed to be Leonard's daydream. Leonard asks Penny out for real, she accepts. Penny imagines marrying Leonard and decides to go to the drug store before the date."
    },
    {
        "text": "Leonard and Penny try an alpha test relationship, but end up giving each other long lists of faults. Leonard accidentally shoots himself while trying to patch things up. Raj falls in love with Siri on his iPhone 4S. Sheldon and Amy start a podcast about flags."
    },
    {
        "text": "Sheldon keeps Leonard up with a drill, leading Leonard to invoke a clause in their agreement to make them acquaintances. Sheldon's other friends won't help him, so he tries to win Leonard back with an emergency kit. Leonard refuses but later reconciles with Sheldon, who reveals he cut the power to win him back. Meanwhile, Howard's attempt to choose his own astronaut nickname backfires."
    },
    {
        "text": "Sheldon refuses to help Amy in her lab and faints during a brain dissection. Howard is upset about a prenup and Penny confronts him and Sheldon. The next day, Sheldon apologizes to Amy and agrees to do basic work. Howard learns about Bernadette's father's extreme views and decides to delay discussing the prenup."
    },
    {
        "text": "Professor Rothman retires, leaving office vacant. Sheldon and Kripke compete for it, settling with a basketball game. Sheldon wins, but hates the office due to noise and thermostat issues. Amy gives Penny a painting she hates. Penny lies to make Amy feel better about the painting."
    },
    {
        "text": "Sheldon's barber is in a coma, so he refuses a haircut from his nephew. Sheldon starts embracing chaos by playing bongos at 3 am. Penny offers to cut his hair, but accidentally shaves the back of his head. Meanwhile, Howard struggles during astronaut training, and Bernadette goes to Houston to support him."
    },
    {
        "text": "Raj proposes a gaming marathon, but Sheldon ditches to attend Amy's family event. Amy gets upset when Sheldon plays remotely, and Penny incites her to confront him. Raj is angry about Howard bringing Bernadette. The girls leave, and the marathon ends when Howard's mother shows up."
    },
    {
        "text": "Penny buys vintage Star Trek transporters for Sheldon and Leonard. Sheldon breaks his toy and switches it with Leonard's, but later confesses. Raj meets a prospective bride, who is a lesbian and agrees to marry him, thinking he is gay. Howard and Bernadette give Raj a puppy to cheer him up."
    },
    {
        "text": "Howard hired to maintain Hawking's wheelchair at Caltech. Sheldon wants to meet Hawking, but insults Howard. Howard agrees to help, but only if Sheldon does embarrassing tasks. Sheldon faints when Hawking finds a mistake in his paper."
    },
    {
        "text": "Howard's bachelor party goes awry when a drunk Raj reveals his past to Bernadette, causing her to question their relationship. Howard apologizes, and Bernadette forgives him, but is still angry. The episode ends with Leonard wanting sex, but Penny refuses."
    },
    {
        "text": "Howard's space mission is initially cancelled, but later reinstated with a launch date on the Friday before his wedding. He seeks approval from Bernadette's father, who surprises him by supporting the space mission. Meanwhile, Leonard accidentally proposes to Penny during sex, leading to her rejecting his proposal. Amy tries to increase Sheldon's feelings for her with little success."
    },
    {
        "text": "Howard, Dimitri, and Mike prepare for a space launch. Howard marries Bernadette before leaving. They plan a small City Hall wedding but end up getting married on a rooftop with their friends as ministers. The episode ends with Howard being launched into space, and the group watches nervously."
    },
    {
        "text": "Howard lies to his mother and Bernadette to avoid conflict. Sheldon outsources romance to Raj, causing chaos on a double date with Leonard and Penny. Amy feels unappreciated by Sheldon, who gives a romantic speech from a movie. Raj bonds with Stuart after being kicked out."
    },
    {
        "text": "Penny worries about her feelings for Leonard. Sheldon learns her secret but doesn't tell Leonard. Later, she sleeps with Leonard to avoid breaking up. Meanwhile, Stuart replaces Howard as Raj's friend, and Howard is bullied in space."
    },
    {
        "text": "Sheldon hires grad student Alex to read his scientific notebooks. Amy gets jealous and Penny becomes jealous of Alex. Penny realizes her feelings for Leonard. Meanwhile, Howard suffers anxiety in space and has a bizarre reaction to sedatives."
    },
    {
        "text": "Sheldon and Leonard lose to Penny and Amy in games. Howard returns from space and feels unappreciated. Bernadette falls asleep, and Howard discovers his mother's affair. Stuart replaces Howard as Raj's best friend. Howard feels lonely but gets a free pie, only to catch Bernadette's cold."
    },
    {
        "text": "Stuart and Raj host a Halloween party at the comic book store. Penny, disliking the party, learns to show interest in Leonard's work. Sheldon and Amy argue over costumes, while Howard's space talk bores his friends. Bernadette reminds Howard she loves him for who he is."
    },
    {
        "text": "Penny hides her return to college from Leonard but eventually tells him. Leonard helps her with a paper, but she rejects his assistance. Later, she reveals a good grade, with help from friends. Sheldon plays Words with Friends with Stephen Hawking and intentionally loses to keep him playing. Hawking mocks him for losing."
    },
    {
        "text": "Sheldon invites Wil Wheaton for a Fun With Flags podcast. Amy demands Sheldon ask Wil to leave, so she leaves. Penny gets Sheldon drunk, and he apologizes to Wil. Howard moves in with Bernadette and finds his old magic set, prompting them to visit his mother."
    },
    {
        "text": "Leonard is jealous of Penny's classmate Cole. After confronting him, Penny overhears and is furious. Meanwhile, Howard and Raj try to uncover Sheldon's secret routine, finding only the number \"43.\" Sheldon fake a video to discourage them, later revealing \"43\" as his hacky sack record."
    },
    {
        "text": "Howard and Sheldon feud over a parking spot, using naked antics and their partners getting involved. Raj mediates an agreement for Howard to keep the spot. The group reconciles at The Cheesecake Factory, but Penny is injured. Sheldon sells his laptop and cleans his cushion."
    },
    {
        "text": "Howard and Bernadette struggle to bond with her father. They go on a fishing trip, but end up bonding over their dominating wives. Meanwhile, Sheldon reluctantly cares for Amy, who pretends to be sick to receive more attention."
    },
    {
        "text": "The men play Dungeons and Dragons while the women have a girls' night. Raj feels lonely and is rejected by a potential partner. In the game, Sheldon sabotages Santa and has a nightmare about him. Raj finds solace in talking to Amy, whom he starts to develop feelings for."
    },
    {
        "text": "Alex invites Leonard to a lecture, but he has a date with Penny. Later, Sheldon is upset that Alex is hitting on Leonard. Sheldon's inappropriate behavior leads Alex to file a complaint. To avoid a sexual harassment seminar, Sheldon implicates others, but eventually has Alex complete the training. Leonard apologizes to Penny, and she embraces her insecurities."
    },
    {
        "text": "Leonard and friends have their car stolen at Vasquez Rocks while attempting a Star Trek photoshoot. Stranded without clothes or phones, they eventually make it to a diner and report the theft. Demoralized, they miss Comic-Con and return home with help from Howard's mother. Meanwhile, the women explore comics and superheroes. The car thieves enjoy a quiz programmed into Leonard's car."
    },
    {
        "text": "Howard and Raj get unrealistic action figures, buy a 3D printer for precise ones. Bernadette is upset about the cost. She removes Howard from their joint account. Sheldon and Kripke work on a project; Sheldon is upset by Kripke's superior work. To hide his insecurity, he supports Kripke's false theory about his relationship with Amy. Later, Sheldon shocks Penny and Leonard with the possibility of a physical relationship with Amy."
    },
    {
        "text": "Leonard moves out after an argument with Sheldon and stays with Penny. Amy wants to move in with Sheldon, creating discomfort. Sheldon tells Amy to leave, causing tension. Leonard returns to Sheldon after a spat with Penny. Raj stays with Howard's mother and she becomes overly attached. Howard asks Raj to check on his mother while he's away."
    },
    {
        "text": "\"On Valentine's Day, Leonard and Penny have a dinner date with Howard and Bernadette, who are in a bad mood. When Penny sees her ex-boyfriend propose, she and Leonard argue. Later, Leonard tells Penny he won't propose again and suggests she propose when ready, to which she agrees. Meanwhile, Sheldon has Alex buy a gift for Amy but keeps it for himself. Raj and Stuart throw a party for singles, and Raj asks Lucy out.\""
    },
    {
        "text": "Raj and Lucy's coffee date goes sour when she flees, but she later apologizes. Raj reveals his selective mutism, and they plan another date. Sheldon enlists Penny's help for his podcast, and she invites him to her play. The play's success impresses Sheldon."
    },
    {
        "text": "Leonard, Sheldon, and Howard struggle to inspire middle school girls in science. They call Amy and Bernadette for help, but the women are at Disneyland. Back home, their Disney princess costumes lead to some interesting interactions. Meanwhile, Raj and Lucy have a texting date and almost share a kiss at the end."
    },
    {
        "text": "Sheldon tidies Howard and Bernadette's closet, finds a letter from Howard's father, and Howard destroys it. Sheldon reveals letter's content, and Howard storms out. At Sheldon's urging, everyone gives a fake version of the letter's content. Howard returns, pleased."
    },
    {
        "text": "After Professor Tupperman's death, Sheldon, Leonard, Raj, and Kripke compete for his tenured position at Caltech. They try to impress Janine Davis, head of the tenure committee, but face multiple obstacles, including offensive comments. Eventually, Sheldon, Leonard, and Raj are shortlisted based on their accomplishments, but Sheldon offends Mrs. Davis again."
    },
    {
        "text": "Sheldon is upset when Alphas is cancelled on a cliffhanger. Amy teaches him to overcome his closure obsession, but Sheldon secretly completes tasks she interrupted. Leonard tries to bond with Penny over Buffy The Vampire Slayer. Penny realizes she is passionate about Leonard and his friends. Raj tries to be more masculine for Lucy but ends up creeping her out. Lucy reassures him that his femininity is a good thing."
    },
    {
        "text": "Sheldon and Leonard ask Professor Proton to do a children's show at their apartment, and he enjoys performing for Penny but is disillusioned about his TV persona. He asks Sheldon to represent him at a party and Sheldon now regards him as his \"father\". Meanwhile, Howard and Bernadette lose Raj's dog but she is found."
    },
    {
        "text": "The women go to Las Vegas, the men play Dungeons and Dragons, Raj leaves to date Lucy. Lucy tries to leave but gets stuck, calls Raj for help. Sheldon and Amy's non-sexual relationship is mocked, they console each other. They admit intimacy and possibly having sex in the future."
    },
    {
        "text": "Stephen Hawking plans an expedition, Leonard replaces a physicist, Sheldon is jealous, Lucy meets the gang, breaks up with Raj, Raj overcomes mutism."
    },
    {
        "text": "Penny and Sheldon bond over missing Leonard. Penny's old secret is known to Sheldon. Leonard shows Penny's movie to his shipmates. Raj apologizes to Mrs. Davis. Amy and Bernadette are bought drinks at a biology convention. Bernadette reveals she was attracted to a man resembling Sheldon."
    },
    {
        "text": "Leonard surprises Penny by coming home early, keeping it a secret from Sheldon. Sheldon, suspecting Penny's cheating, bursts in and finds Leonard. Sheldon gets mad, but reconciles with Leonard. Howard gains weight and mood swings from estrogen ointment. Raj can now talk to women without alcohol after a North Sea expedition."
    },
    {
        "text": "Raj creates scavenger hunt, teams compete to find gold coin, but all end up angry when Raj reveals everyone wins, teaching friendship value. Howard and Amy bond over Neil Diamond, others chase Raj out, Howard and Amy sing at The Cheesecake Factory instead."
    },
    {
        "text": "Amy criticizes Indiana Jones, upsetting Sheldon. He seeks revenge by spoiling her favorite show. They reconcile. Penny buys a book upsetting Leonard, who takes advantage of her sympathy. Howard's trick backfires, and Penny takes revenge on Leonard. Raj and Stuart move on from online dating."
    },
    {
        "text": "Amy gets a job at Caltech but Sheldon withdraws his approval. He embarrasses her in front of colleagues, but later apologizes. Howard offends Bernadette, leading to tension. Both couples are upset, and the guys ignore their problems, angering the women even more."
    },
    {
        "text": "Sheldon makes a mistaken scientific discovery, feeling like a fraud, despite praise from his friends and colleagues. Howard sings for Bernadette in the hospital. Penny gifts Leonard a special book, but he realizes she has been romantic all along, keeping mementos of their time together."
    },
    {
        "text": "Sheldon, Leonard, and Amy meet Professor Proton at the drug store. Sheldon tries to apologize to him but ends up annoying him more. Sheldon makes friends with Bill Nye \"the science guy\". Leonard explains why he lives with Sheldon to Professor Proton. Howard takes over girls' night, upsetting Raj. Raj and Howard reconcile, and Raj makes belt buckles using techniques taught by Howard."
    },
    {
        "text": "Leonard finds an overdue DVD, but Sheldon stays calm. Leonard searches for the store, but it's closed. Sheldon reveals he paid the fine years ago. Penny meets Raj's ex, Lucy, who now has a new boyfriend. She sets Raj up with a friend, but he freaks out."
    },
    {
        "text": "The gang celebrates Thanksgiving at Mrs. Wolowitz's, with cooking and tension. Penny realizes she's legally married to Zack, causing issues with Leonard. Howard struggles to bond with his father-in-law, but Sheldon connects with him over football. Sheldon apologizes to Howard and then drunkenly flirts with Amy. Penny gets Zack to sign annulment papers, and she and Leonard reconcile."
    },
    {
        "text": "Sheldon walks out of a interview after Leonard disproves his discovery. Raj moves in with Howard and Bernadette and their relationship struggles. He then moves in with Sheldon and Leonard, giving them advice. Amy asks Raj to leave after he advises her to be patient with Sheldon's limits."
    },
    {
        "text": "Sheldon is unhelpful during his sister's home birth. His friends imagine their lives without him. Sheldon realizes Amy's influence on him. Leonard asks Penny out but she is dating Stuart. The scene changes to reveal it as Stuart's fantasy."
    },
    {
        "text": "Penny's scene is cut from NCIS, causing tension with Leonard. He questions her acting ambition, upsetting her. He offers her an audition for Star Wars, but she gets drunk and proposes to him. He hesitates, and she walks out. Meanwhile, Sheldon tries to be funnier, and Bernadette confesses to faking laughs at Howard's jokes."
    },
    {
        "text": "Penny quits her job to pursue acting, Leonard hesitates but supports her. Sheldon tags along with Penny. Bert tries to woo Amy with rocks, Howard and Raj intervene. Bernadette damages Howard's comic, confronts a rival store owner."
    },
    {
        "text": "Sheldon creates his own comic book convention and befriends James Earl Jones. The guys fail to get Comic-Con tickets, while the girls try to feel grown-up. Jones invites Sheldon and his friends to attend Comic-Con with him. Meanwhile, Leonard, Raj, and Howard chicken out of meeting a ticket scalper."
    },
    {
        "text": "Amy plans a romantic Valentine's Day on the Napa Valley Wine Train with Sheldon, but Sheldon's new friend ruins her plan. After confronting Sheldon, he offers sarcastic romantic gestures, but their supposedly fake kiss becomes real, marking the first time Sheldon initiates physical contact. Meanwhile, Leonard and Penny's dog-sitting for Raj's dog goes awry when the dog eats chocolates and they rush her to the vet. At the vet, Raj connects with Yvette and gets her phone number."
    },
    {
        "text": "Leonard and Penny buy a dining table, causing conflict with Sheldon. Sheldon tries to break up with Amy, but Penny and Amy manipulate him. NASA asks Howard to return to space, but he finds a way out by failing his physical."
    },
    {
        "text": "Penny rejects a movie role and considers returning to her old job. Leonard surprises her with a new car to support her acting career. Sheldon confronts Howard about his insults, leading to a NASA trip to bond. Raj's passivity ruins a potential friendship with Emily and Amy."
    },
    {
        "text": "Sheldon and Howard surprise his mother, but flee after seeing her having sex. After an argument, Sheldon apologizes to Mary. The gang attends a murder mystery dinner. In a future scenario, Leonard and Penny argue and Stuart believes they will end up together. In 20 years, only Stuart shows up for a dinner with the gang."
    },
    {
        "text": "Raj must choose between dating Emily and Lucy, Penny considers a role in a bad horror movie, and Sheldon struggles to decide between PlayStation 4 and Xbox One. Leonard and Penny seek advice from Wil Wheaton, who ends up depressed. Bernadette mistakenly signs a \"get well\" card for a co-worker she thought was retiring."
    },
    {
        "text": "Raj and Howard's double date goes awry when Howard becomes the butt of jokes. Sheldon considers giving up on string theory, leading to a drunken escapade and calls to Stephen Hawking."
    },
    {
        "text": "Sheldon, Leonard, and Penny search for new activities. They find Amy and Bernadette lying. Amy admits jealousy of Penny's relationship with Sheldon. Penny tells Howard about Bernadette's lie. Raj and Howard watch a disturbing film. Penny takes Sheldon to a psychic, who suggests committing to Amy. Amy apologizes to Sheldon, who acts unfazed."
    },
    {
        "text": "The guys prepare for Star Wars Day but learn of Professor Proton's death. Leonard and Penny discuss regrets, and she proposes to make him feel better. Sheldon dreams of Proton advising him to cherish the present. The others make a Death Star cake and discuss their love of science. Sheldon dreams of Proton again, reinforcing his love for Star Wars."
    },
    {
        "text": "Howard, Bernadette, and Raj try to move a treadmill for Howard's mother, but it ends in disaster. Penny gets fired from a movie and Leonard proposes to her, while Raj struggles with women."
    },
    {
        "text": "Leonard and Penny get engaged, but the group focuses on Raj and Emily's sex. Sheldon is upset about the university and Leonard and Penny not wanting to live with him. He leaves town, but Leonard convinces him to come back. Howard offers Stuart a job and home, and he becomes close to Howard's mother."
    },
    {
        "text": "Sheldon's journey home from Pasadena ends in Kingman, Arizona, where all his belongings are stolen. He calls Leonard and Amy for help, and confesses he left without telling Amy. Amy is hurt, but forgives him. Sheldon struggles with change, and Penny gets a job with Bernadette's help. Howard and Raj find Stuart living with Howard's mother."
    },
    {
        "text": "Sheldon becomes a junior professor, but no one signs up for his class. Howard takes it to work on his doctorate, but Sheldon makes it difficult. They reconcile and celebrate each other's intelligence. Meanwhile, tension arises between Penny and Bernadette over studying for a pharmaceutical job, and Amy enjoys playing both sides until her friends reconcile."
    },
    {
        "text": "Howard throws first pitch, misses. Uses Mars rover to deliver, gets booed. Sheldon and Amy double date with Penny and Leonard. Sheldon claims their relationship is stronger. Leonard wants compatibility test, Penny refuses. Leonard's commitment overwhelms Penny."
    },
    {
        "text": "Leonard and Penny meet Raj's girlfriend Emily. Emily is unhappy that Penny hooked up with Raj. The men invest in Stuart's comic book store. Howard's mother gives money to Stuart. The men are disappointed with the store's atmosphere."
    },
    {
        "text": "Sheldon and the men try to brainstorm new inventions but keep getting distracted. The women go to Vegas, where Amy and Bernadette get drunk and take Penny to a strip club. The next morning, Penny gets revenge on the hungover Amy and Bernadette."
    },
    {
        "text": "Penny sells Leonard's gift for a company car, causing a conflict. Howard and Bernadette argue over money. Leonard and Penny use it as an example for their marriage. Sheldon and Raj face fears in a tunnel experiment. Sheldon abandons Raj, leading to an argument. Their simulation lasts longer than expected."
    },
    {
        "text": "Sheldon meets Dr. Lorvis, who flirts with Penny. Leonard explains that Penny is his fianc��e. Lorvis invites the men to see his sci-fi collection. Meanwhile, a magazine cancels an article about Bernadette due to Amy's complaint. Lorvis locks the men in his basement to pursue Penny, but ends up falling for Amy and Bernadette. They all end up at Lorvis' house, where the men are too busy playing to notice."
    },
    {
        "text": "The girls find Penny's old prom dress and decide to have a new prom on the roof. Sheldon worries about post-prom intimacy with Amy, who reassures him. Sheldon surprises Amy by saying he loves her, causing her to have a panic attack. Howard is upset when Stuart brings Howard's second-cousin as his date. Emily loves dark fairy tales, and Leonard and Penny dance romantically."
    },
    {
        "text": "Leonard needs surgery, Sheldon opposes, but Leonard sneaks to hospital. Sheldon worries during mild earthquake. Both return home with bandaged noses, Sheldon unintentionally orders morbid urns. Raj's parents divorce, worrying Bernadette and Howard about their own marriage. They end up bickering instead of being positive."
    },
    {
        "text": "Leonard, Raj, and Howard find Roger's calorie diary, learn not every scientist makes great discoveries. Sheldon's final \"Fun with Flags\" episode includes a surprise guest, prompting a potential revival. Penny helps Bernadette realize her bullying behavior and mend workplace relationships. Dan apologizes and resumes fulfilling Bernadette's wishes."
    },
    {
        "text": "Raj unable to host Christmas dinner, Amy hosts Victorian dinner. Sheldon buys revenge gift. Bernadette takes him to mall. Sheldon surprises Amy with gift, she gives him cookies. Leonard and Howard have trouble in clean room. Accidentally injure pigeon. Penny convinces them to leave lab."
    },
    {
        "text": "Sheldon and Leonard's friendship is tested as they argue about compromises, leading to an emotional breakthrough. Leonard decides to gradually move out, while Sheldon agrees to spend time at Penny's. Meanwhile, Raj deals with stress and anger, but finds solace in visiting a Hindu temple with Howard and Bernadette."
    },
    {
        "text": "Sheldon struggles with anxiety in his research. His friends irritate him, leading to exhaustion and hallucinations. Amy kicks him out during their date. After singing, Sheldon sleeps and continues his research. Meanwhile, Howard invents a game, embarrassing Raj and his girlfriend."
    },
    {
        "text": "Leonard and Sheldon's theory is well received online, but they are trolled by an anonymous user. They confront the troll, who turns out to be Stephen Hawking. Meanwhile, the girls embarrass each other at Penny's apartment, and Amy's fan fiction about her and Sheldon backfires."
    },
    {
        "text": "Amy helps Kripke with string theory, upsetting Sheldon. Amy secretly runs experiments on Penny and Leonard. Leonard and Raj meet Nathan Fillion. Stuart opens a store. Howard's mother dies, and the group comforts him."
    },
    {
        "text": "Sheldon and Penny try the love experiment but don't fall in love. They bond over their wishes and reflect on their friendship. Meanwhile, Raj, Emily, Leonard, and Amy solve puzzles too quickly, and Howard and Bernadette are upset when the airline loses his mother's ashes."
    },
    {
        "text": "Sheldon and Amy buy a pet tortoise, but their relationship is strained when Sheldon applies to colonize Mars without consulting Amy. They work through their issues and decide to apply as a couple. Leonard and Penny experiment with sex on a canvas, and Raj breaks a drawer in Emily's apartment, leading to a scare prank."
    },
    {
        "text": "Scientific American praises Leonard and Sheldon's paper but omits Leonard's name. Penny cheers up Leonard. Howard, Bernadette, and Raj visit Howard's mother's home, and Howard decides to have a dinner with friends to honor his mother. Sheldon and Leonard argue, and Bernadette scolds them for being insensitive. They overeat and are happy when Leonard's name is mentioned in Physics Today."
    },
    {
        "text": "Sheldon and Leonard visit Skywalker Ranch before giving a lecture at UC Berkeley. Sheldon tries to meet George Lucas and gets hit with a Taser, leading to a ban from the ranch. Meanwhile, the gang argues over selling a TARDIS, ultimately deciding its fate through a ping pong match. Amy tricks Sheldon into her bedroom, but he leaves disappointed."
    },
    {
        "text": "Sheldon is excluded from a symposium at Richard Feynman's house. Penny gets an audition for Clerks III, causing tension with Leonard. Howard inherits his mother's house and meets his half-brother, Josh. Wil Wheaton talks about a bad movie with Penny on his podcast."
    },
    {
        "text": "Raj seeks advice from Sheldon and Howard for NASA proposal. Raj and Leonard exclude them but later ask for help. The guys discuss feeling excluded. Penny seeks advice from Sheldon about her career. She goes to an audition but is discouraged by the competitive environment. She thanks Bernadette and takes her and Amy to dinner."
    },
    {
        "text": "Leonard and Penny's flight to his old high school is cancelled. Penny arranges a Skype speech for Leonard, who inspires forgotten students. Raj's quadcopter troubles result in his father cutting off his allowance. The quadcopter activates and terrorizes the apartment before tech support is called."
    },
    {
        "text": "Sheldon and Leonard's mothers visit for an award ceremony. Beverly and Mary argue over their sons, Penny's ring, and religious beliefs. Howard, Bernadette, and Raj struggle with living together. Beverly and Mary make up, while the men clean the kitchen and sing together."
    },
    {
        "text": "Sheldon offends Amy while making out on their anniversary. Amy rejected Sheldon's proposal. Amy takes a break from the relationship. Leonard admits to kissing another woman. Howard and Bernadette struggle to ask Stuart to move out. Raj considers breaking up with Emily but ultimately tells her he loves her."
    }
    {
        "text": "On a tumultuous Saturday afternoon, friends gathered in Sheldon and Leonard's apartment. Sheldon sat in his usual spot on the sofa, awkwardly explaining to Leonard and Raj why Amy rejected his marriage proposal. Although he tried to maintain composure, his eyes could not hide his disappointment. Meanwhile, Leonard was determined to change. He promised Penny that he would be more supportive and present as a partner. Penny was comforted by this as she browsed online courses, hoping to find new career opportunities to reignite her professional passion. Howard spoke with Bernadette in the kitchen about possibly expanding their family. Although Bernadette was nervous about adding a new member, she also showed a glint of excitement. In a quiet corner of the park, Raj and Emily shared sweet memories of their recent getaway, and Raj was determined to deepen their relationship, feeling hopeful about their future together. Amy discussed her rejection of Sheldon's proposal with Penny, seeking comfort and assistance. In this time of change, friends supported each other, facing life’s challenges and transitions together, strengthening their bonds in the process."
    }
]